# *Load library*

In [2]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder, StandardScaler

# *Load Data*

In [4]:
# dpath for data path
dpath = 'Data/Titanic-Dataset-fixed.csv'
# df for data frame
df = pd.read_csv(dpath)
# show the first 5 rows of the data
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,DECK,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,DECK,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,DECK,S

# *Data Slicing*

In [8]:
# slicing the data for selecting features
df = df[['Survived', 'Pclass', 'Age', 'Sex', 'Cabin']]
df.head()

   Survived  Pclass   Age     Sex Cabin
0         0       3  22.0    male  DECK
1         1       1  38.0  female   C85
2         1       3  26.0  female  DECK
3         1       1  35.0  female  C123
4         0       3  35.0    male  DECK

# *Data Encoding*

In [10]:
# create variable for objet LabelEncoder
le = LabelEncoder()
# Sex and Cabin are categorical data 
# because the data is not numerical, we need to encode it
# we can use LabelEncoder to encode the data to numerical
df['Sex'] = le.fit_transform(df['Sex'])
df['Cabin'] = le.fit_transform(df['Cabin'])

## *Verify encoded Data*

In [15]:
df.head()

   Survived  Pclass   Age  Sex  Cabin
0         0       3  22.0    1    115
1         1       1  38.0    0     81
2         1       3  26.0    0    115
3         1       1  35.0    0     55
4         0       3  35.0    1    115

# *Standardization Data*

In [17]:
# create variable for StandardScaler object
std = StandardScaler()
# we standardize Age data
# actually this not necessary, but we do this for the sake of example
df['Age'] = std.fit_transform(df[['Age']])

## *Verify Standardized Data*

In [18]:
df.head()

   Survived  Pclass       Age  Sex  Cabin
0         0       3 -0.592481    1    115
1         1       1  0.638789    0     81
2         1       3 -0.284663    0    115
3         1       1  0.407926    0     55
4         0       3  0.407926    1    115